#include "Menu.h"
int Menu::op_select()
{
	int  select;
	do
	{
		system("cls");
		cout<<"  ####################################################\n";
		cout<<"  #                                                  #\n";
		cout<<"  #               欢迎登录客房管理系统               #\n";
		cout<<"  #                                                  #\n";
		cout<<"  ####################################################\n";
		cout<<"  #            1.    客人入住办理                    #\n";
	    cout<<"  #            2.    客人退房办理                    #\n";
		cout<<"  #            3.    显示所有房间信息                #\n";
		cout<<"  #            4.    显示空闲房间信息                #\n";
		cout<<"  #.           5.    显示已入住房间信息              #\n";
		cout<<"  #.           6.    显示所有客人信息                #\n";
		cout<<"  #.           7.    查询房间信息                    #\n";
		cout<<"  #.           8.    查询客人信息                    #\n";
		cout<<"  #            9.    修改房间信息                    #\n";
		cout<<"  #            0.    退出客房管理系统                #\n";
		cout<<"  ####################################################\n";
		cout<<"给出你的操作:";
		cin>>select;
	}while(select<0 || select>9);
	return select;//返回选择的功能
}
